Service - Payday Filing/Archive/V1/Employee Details/sample messages/body-employment-retrievelist-request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
               xmlns:emp="https://services.ird.govt.nz/GWS/Employment/"
               xmlns:ret="https://services.ird.govt.nz/GWS/Employment/:types/RetrieveListRequest"
               xmlns:emp1="urn:www.ird.govt.nz/GWS:types/Employment"
               xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v1">
    <soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
        <wsa:Action>https://services.ird.govt.nz/GWS/Employment/Employment/RetrieveList</wsa:Action>
    </soap:Header>
    <soap:Body>
        <emp:RetrieveList>
            <emp:RetrieveListRequestMsg>
                <ret:RetrieveListRequestWrapper>
                    <emp1:retrieveListRequest>
                        <emp1:header>
                            <com:softwareProviderData>
                                <com:softwareProvider>SoftwareProvider</com:softwareProvider>
                                <com:softwarePlatform>SoftwarePlatform</com:softwarePlatform>
                                <com:softwareRelease>1.0</com:softwareRelease>
                            </com:softwareProviderData>
                            <com:identifier IdentifierValueType="ACCIRD">123456789</com:identifier>
                            <com:accountType>PSO</com:accountType>
                        </emp1:header>
                        <emp1:retrieveListBody>
                            <emp1:employeeIRD>123114116</emp1:employeeIRD>
                        </emp1:retrieveListBody>
                    </emp1:retrieveListRequest>
                </ret:RetrieveListRequestWrapper>
            </emp:RetrieveListRequestMsg>
        </emp:RetrieveList>
    </soap:Body>
</soap:Envelope>